better readme and cli help
Signed-off-by: Jorge Prendes <jorge.prendes@gmail.com>
